In [17]:
import pandas as pd
import numpy as np

## Series

In [2]:
obj = pd.Series([4,7,8,9,-5])
obj

0    4
1    7
2    8
3    9
4   -5
dtype: int64

In [3]:
obj.values

array([ 4,  7,  8,  9, -5])

In [4]:
obj.value_counts

<bound method IndexOpsMixin.value_counts of 0    4
1    7
2    8
3    9
4   -5
dtype: int64>

In [5]:
obj.index

RangeIndex(start=0, stop=5, step=1)

In [15]:
obj2 = pd.Series([4,7,-8,-9], index=['a', 'b', 'c', 'd'])
obj2[obj2>0]*2

a     8
b    14
dtype: int64

In [8]:
obj2.index

Index(['a', 'b', 'c', 'd'], dtype='object')

In [10]:
obj2['b']

7

In [12]:
obj2[['a', 'd']]

a    4
d    9
dtype: int64

In [19]:
np.exp(obj2[obj2<0])

c    0.000335
d    0.000123
dtype: float64

In [20]:
'b' in obj2

True

In [21]:
1 in obj

True

In [22]:
100 in obj

False

In [24]:
#creating pandas Series by passing the dict:
sdata= {'Ohio':35000, 'Texas':43000, 'Oregon':16000,'Utah':5000}
sdata

{'Ohio': 35000, 'Texas': 43000, 'Oregon': 16000, 'Utah': 5000}

In [26]:
obj3 = pd.Series(sdata)
obj3

Ohio      35000
Texas     43000
Oregon    16000
Utah       5000
dtype: int64

In [28]:
states = ['Cali', 'Ohio', 'Oregon', 'Texas']
obj4 = pd.Series(sdata, index=states)
obj4

Cali          NaN
Ohio      35000.0
Oregon    16000.0
Texas     43000.0
dtype: float64

In [29]:
pd.isnull(obj4)

Cali       True
Ohio      False
Oregon    False
Texas     False
dtype: bool

In [31]:
obj3

Ohio      35000
Texas     43000
Oregon    16000
Utah       5000
dtype: int64

In [32]:
obj4

Cali          NaN
Ohio      35000.0
Oregon    16000.0
Texas     43000.0
dtype: float64

In [33]:
obj3+obj4

Cali          NaN
Ohio      70000.0
Oregon    32000.0
Texas     86000.0
Utah          NaN
dtype: float64

In [34]:
obj3.name = 'population'
obj4.index.name = 'state'

In [35]:
obj3

Ohio      35000
Texas     43000
Oregon    16000
Utah       5000
Name: population, dtype: int64

In [36]:
obj4

state
Cali          NaN
Ohio      35000.0
Oregon    16000.0
Texas     43000.0
dtype: float64

In [37]:
obj

0    4
1    7
2    8
3    9
4   -5
dtype: int64

In [41]:
obj.index = ['Bob', 'Steve', 'Mike', 'John', 'Poll']

In [42]:
obj

Bob      4
Steve    7
Mike     8
John     9
Poll    -5
dtype: int64

## Dataframe

In [46]:
data = {'state': ['Ohio', 'Ohio', 'Ohio', 'Nevada', 'Nevada', 'Nevada'],
       'year':[2000, 2001, 2002, 2001, 2002, 2003],
       'pop':[1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame

    state  year  pop
0    Ohio  2000  1.5
1    Ohio  2001  1.7
2    Ohio  2002  3.6
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

In [47]:
frame.head(2)

  state  year  pop
0  Ohio  2000  1.5
1  Ohio  2001  1.7

In [48]:
pd.DataFrame(data, columns=['year', 'state', 'pop'])

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9
5  2003  Nevada  3.2

In [50]:
frame2 = pd.DataFrame(data, columns=['year', 'state', 'pop', 'debt'])
frame2

   year   state  pop debt
0  2000    Ohio  1.5  NaN
1  2001    Ohio  1.7  NaN
2  2002    Ohio  3.6  NaN
3  2001  Nevada  2.4  NaN
4  2002  Nevada  2.9  NaN
5  2003  Nevada  3.2  NaN

In [51]:
frame2.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

In [52]:
frame2['state']

0      Ohio
1      Ohio
2      Ohio
3    Nevada
4    Nevada
5    Nevada
Name: state, dtype: object

In [53]:
frame2.year

0    2000
1    2001
2    2002
3    2001
4    2002
5    2003
Name: year, dtype: int64